EXTERNAL get_flag(a0)
EXTERNAL set_flag(a0)
EXTERNAL unlock_codex(a0)

-> main

=== main ===
«Стой, где стоишь, дознаватель. Пепел тут кругом, но дыра одна — вон она, за трубой. Ты туда не наступи.»
-> main__hub


=== main__hub ===
+ [Что нибудь находили в пепле?]
    «Разное находили. Пуговицы, обручальные кольца, монеты — монеты, дознаватель! В третьем помоле монеты не плавятся, потому что третий помол — люди. Ты вот государственный человек, тебе виднее, куда это писать.»
    ~ set_flag("timm_ash")
    ~ unlock_codex("codex_ash")
    -> main__hub
+ [Крон часто бывал в литейной?]
    «Каждую неделю. Считал, сколько пепла уходит в жерло, и всё хмурился. В прошлый раз спрятал что-то в нишу за трубой — думал, я слепой. А я вижу, но не говорю.»
    ~ set_flag("timm_niche_hint")
    -> main__hub
+ {get_flag("timm_niche_hint") == 1} [Что в нише?]
    «Тетрадь в коже. И не спрашивай больше ничего: я свою спину до пенсии донести хочу.»
    -> main__hub
+ [Кто ещё ходит к горну?]
    «Люди в серых плащах. Приходят, смотрят в жерло, будто там что-то новое может появиться. Один раз с ними была женщина с латунной рукой. От её взгляда даже огонь притихает.»
    -> main__hub
+ [Работай, старик. Я вернусь.]
    -> DONE
- -> main__hub
