EXTERNAL get_flag(f)
EXTERNAL set_flag(f)
EXTERNAL has_item(id)

=== main ===
У ворот дежурит надзиратель в прокопчённом полушубке. Он греет ладони о трубу печки. # action
-> guard_hub

=== guard_hub ===
+ { has_item("item_badge") } [Показать бирку дознавателя.]
    Надзиратель: Проходите. На Третьем нынче неспокойно: батареи стынут, народ злой. # action
    -> guard_hub
+ { not (get_flag("guard_hint")) } [Кто ночью ходит через ворота?]
    ~ set_flag("guard_hint")
    Надзиратель оглядывается и понижает голос. # action
    Надзиратель: Гильдейские. Кожаные фартуки, красные бирки. Идут вниз, за Гильдию, к старым лазам. И ведь не мёрзнут, твари.
    -> guard_hub
+ [Холодно сегодня?]
    Надзиратель: Пепельник с Дымного сыплет — к морозу. Держись печек, дознаватель.
    -> guard_hub
+ [Мне пора.]
    -> DONE
- -> guard_hub
