EXTERNAL open_trade(n)
EXTERNAL sleep(h)
EXTERNAL set_flag(f)
EXTERNAL change_need(n, d)
EXTERNAL advance_time(t)
EXTERNAL has_item(id)
EXTERNAL remove_item(id, q)
EXTERNAL change_hp(d)

=== main ===
Торг опирается о стойку и сверлит тебя взглядом из-под седых бровей.
— Новая рожа. В Крезне свежие лица либо скрываются, либо мертвы. К какой категории относишься ты?
-> main_hub

=== main_hub ===
+ [Мне нужна еда и ночлег.]
    — Миска похлёбки — пять марок. Кружка тёмного — марка. Матрас в углу, без клопов не обещаю, — ещё пять.
    -> main_hub
+ [Расскажи, что тут у вас происходит.]
    Он трет подбородок.
    — Рабочие пропадают. Вторую смену. Гильдия говорит — разбежались по деревням. Но я в этих краях двадцать семь лет: рабочие не бегут зимой, даже от цеха.
    — Поговаривают, что в цехе №7 что-то взорвалось. Не удивлён: старый Мастер последние месяцы гнал в три смены, гнал… Догнался.
    { get_flag("found_first_body"):
        — А ты, видать, как раз оттуда? Совет дам за так: не лезь в это. Схарчат тебя шестерни.
    }
    -> main_hub
+ [Ты не видел женщину из Гильдии? Высокая, тёмная мантия.]
    — Мавра? Он плюёт в опилки. — Была здесь, спрашивала о чужаке. Тебя, стало быть, ищет. Она не просто распорядитель — она у старого Мастера правая рука. Говори с ней осторожно.
    ~ set_flag("talked_to_maeva")
    -> main_hub
+ [Торговля.]
    ~ open_trade("npc_torg")
    -> DONE
+ [Ночлег (5 марок).]
    * { has_item("item_silver") >= 5:
        Он кивком указывает на закуток с тюфяком.
        ~ remove_item("item_silver", 5)
        — До утра не трогаю.
        ~ change_need("need_fatigue", -60)
        ~ change_need("need_hunger", -15)
        ~ change_need("need_thirst", -15)
        ~ change_hp(3)
        ~ advance_time(8)
        Ты проваливаешься в сон, и тебе снятся шестерни под кожей.
        -> DONE
    }
    — Пять марок вперёд. У меня не богадельня.
    -> main_hub
+ [Спасибо за разговор.]
    Он молча возвращается к протиранию кружки.
    -> DONE
- -> main_hub
